{
  "Projects": [
    {
      "Title": "The Autonomous Vehicle Project",
      "Subtitle": "2nd Year University Project (2019)",
      "Body": "In my 2nd year of University in Trinity College Dublin we were tasked with a challenging tech/engineering based project: To build A self driving buggy that could steer itself around a predefined track, it also could recognise objects and stop/go according to their colour. It accounted for a large portion of our grade and so it was really important that we performed not only well but exceeded our goal.I wanted to become project lead as this was the first tech based project we had some creative freedom over. I put myself forward and I’m glad I did as I learned a lot from the experience. I wanted to do a great job at leading the project. I spent a lot of time reading up on project-management, interviewing managers and reading online forums. If I was going to do it, I was going to do it right.\n\n We chose to adopt a sort of Agile methodology early on. This was because it was popular at the time and online forums seemed to agree. We defined project vision and scope and delegated various portions of the work (hardware, software, logic design, algorithms) into Agile story sized tasks. We set short term goals to achieve project deliverables, present a minimum viable product and later a fully realised product.\n\nThe technology we used was an Arduino-uno board (Micro-controller), Servo motors to rotate the wheels, infra-red sensors to detect the track, A Pixy-Cam for computer vision (to detect the coloured objects), and the steering system was powered by a custom logic board we fabricated ourselves.\n\n We had some unexpected setbacks in the project also. One of our team members left halfway through and so we had extra work to divide. This left to some contention in the group as everyone was pretty busy already. We solved this through constant communication and helped each-other out. Additionally we accidentally fried our logic board with only a few weeks left until the demo-date. We worked overtime to build the new logic board. Unfortunately progressed slowed due to various reasons and we had to cut some final features, one of them included spicing up the UI of the laptop-client.\n\nEventually it was the project demo date. We demonstrated that our buggy work and hit the initial goal. We also succeeded at hitting the next optional milestone of image recognition. However with all the cut feature we lost the overall competition.\n\nOverall it was a huge success and one of my most memorable University projects. I got some great experience with project-management and communication. I also enjoyed the creative freedom to approach the project and prioritise certain features.\n\n"
    },
    {
      "Title": "Distributed Data Fabric",
      "Subtitle": "Covid-19 Hospital Database",
      "Body": "In my third year of University, I took a class in Computer Networks. It was an introduction to the fundamentals of the field from Network protocols and the OSI model to Peer-to-peer networks. As part of this class we were divided into groups and tasked with creating a ‘distributed network fabric’. It was an intentionally broad assignment which tested our curiosity in the subject area and also to work as a team and narrow the project scope into something achievable in the time constraint.\n\nOn reading about the are of peer-to-peer networks I decided to try and create one myself. I had a prototype distributed messaging system that wasn’t very reliable but it worked as a proof on concept. I showed my work to the team and we worked together to find a use case for it. I built the prototype using low level programming and web-sockets.\n\nAfter further discussion we decided to modify the messaging system into a reverse-engineered distributed database to quickly and safely share hospital information around the country. We created an in-memory database with a Write-Ahead-Log and a dump to disk timer so that we could reconstruct the database on a crash. I wrote a replication algorithm based on NN to ensure data wasn’t lost on unstable dropouts. These along with a few other features made the db as BASE compliant as we could make it.\n\n"
    },
    {
      "Title": "OpenGL Computer Graphics Project",
      "Subtitle": "",
      "Body": ""
    },
    {
      "Title": "This Website",
      "Subtitle": "Personal Site",
      "Body": "I’ve been working on web-development for the past few years either on projects for college or work related. I’ve used different web-frameworks but am most comfortable with React. I wanted to make a personal page where I could collect and store relevant info and projects. This website represents me and what I’ve learned about web-design. I’m really proud of how it turned out.\n\nI decided to use the React framework to build the website. I also wanted to challenge myself to use ‘Hooks’ as I had only experimented with them before. I’m using GitHub as remote source control and have a pre-commit hook installed to auto-format my code ‘Prettier’. I’m using Netlify for deployment and have it directly connected to the remote GitHub repository. It acts as convenient almost no-cost Continuous Integration setup.\n\nAdditionally for greater challenge I chose not to rely on any 3-rd party component/asset libraries. I created all components myself. I’m using React Transition Group to access transition states for animation effects.The greatest challenge here seemed to be dynamic/scalable layouts. Different devices create various scaling issues and readability challenges come with that. I found it helpful to get feedback from friends/family as resizing a browser window for hours can give me tunnel vision. I learned that simple, clean U.I. is more effective to the user and not as simple as it appears to be. Overall I’m very proud of what I’ve achieved on this side-project and I’ve learned a huge amount.\n\n"
    },
    {
      "Title": "Hakathon: AIB Datahack 2017",
      "Subtitle": "Hackathon 2017",
      "Body": "In 2017, I took part in my first Hackathon. It was hosted by AIB and themed on ‘Smart-Cities’ called DataHack. My partner and I decided to create an android app for the future. It was a carpooling app for autonomous vehicles. We wanted to create an app using pathfinding and scheduling algorithms to decide whether or not to add customers to the current carpool. The idea is like a carpool Uber. The main focus here was to get a proof of concept finished within the time constraints.\n\nWe arrived on site and we immediately impressed by their offices, as most 1st year Computer Engineers would be. We had ten hours from project start to create a working prototype and present to a board of members within AIB. We split up the work and created a timeline of features. We prioritised the minimum features and left more if time permitted. Priority items included: basic application interface for android, google maps api support, basic point to point pathfinding etc. Additionally more complicated features included priority customer queues, dynamic route recalibration, comparing algorithms, better UI and more.\n\nIt helped that we were really good friends and so communication wasn’t ever an issue. I proposed that we should have a quick chat and review our progress every hour until time was up. This was a great idea as it highlighted the areas we were falling behind on. Eventually we had a working prototype and presented it. We quickly scrambled a powerpoint together and presented to the judge panel. They were very impressed by our work considering we were first-years. We were really happy with our progress considering we had to cut some complex features.\n\nOverall I had a great time, rushing to the finish fuelled on energy drinks and our competitive spirit. I learned a lot from the people I spoke to and the friends I made. I spoke to the senior engineers and software devs on the industry and it was great to get that level of exposure. I also learned how to plan on a short deadline and prioritise certain objectives to achieve the minimum viable product. I also learned that people are far more capable than they think they are.\n\n"
    }
  ]
}
