{
  "Intro": {
    "Title": "Hey!",
    "Subtitle": "",
    "Body1": "Welcome to my website. I built it myself by using the ",
    "Body2": "framework. I chose to use React “Hooks” instead of traditional “State” techniques to see how it compared and learn something new Hooks are great! \n\n I’m using this site to collect and display all of my personal projects, work experience and some blog-type articles too.",
    "Link": "React "
  },
  "Bio": {
    "Title": "Bio",
    "Subtitle": "",
    "Body": "I’m a Software Engineer and Tech Enthusiast. Graduated with Master of Computer Engineering (M.A.I.) at Trinity College Dublin, with a special interest in Distributed Computing, U.I. and Game Development. I’m proficient in a range of computer languages from C to Python. I also have experience with Web-design and API’s, DevOps, UNIX commands and design philosophy, Network Protocols, Server Management and CICD.\n\n I’ve learned what I know from University, Work Experience and personal projects. I’ll provide more info on this site."
  },
  "Tech": {
    "Title": "Tech",
    "Subtitle": "Some of the tools I've worked with:",
    "Body": "Languages: Python, C, C++, C#, Java,  JavaScript, Assembly \n\nWeb-Frameworks: Spring/SpringBoot (Java), Flask (Python) \n\nU.I.-Frameworks: React, Angular\n\nDistributed Tech: Hadoop, HDFS, Apache Spark, Apache Kafka, Docker, Kubernetes\n\nDatabases: Oracle Sql, MySQL, PostgreSQL, Memcached"
  },
  "Experience": [
    {
      "Title": "",
      "Subtitle": "Software Engineer: MetaSearch Bidding Infrastructure\nExpedia Group",
      "Body": "At Expedia Group I work within the Metasearch-Bidding Infrastructure team in the Brands department. I work collaboratively within a team of 5-10 engineers across London and Seattle. My role involves developing backend applications and ETL pipelines through adding requested features, supporting and maintaining large code bases. I’m proficient in cloud-tech and I deploy cloud infrastructure using terraform on AWS. I work within a containerised ecosystem using docker. I’ve recently completed a large development project with 5 engineers to migrate an existing legacy System/Product to adopting the company standards and save on cost. In this process I was able to identify and fix unclean legacy code, remove unnecessary complexity and optimise the resource usage within the legacy Apache Spark Jobs. This resulted in 45% decreased job runtime and 25% reduced cost. I’ve also delivered a solo project to migrate an existing multi-million dollar Legacy bid submission application which was spread across different AWS accounts and regions to centralise our infrastructure and improve performance.\nPython, AWS, Airflow, Terraform"
    },
    {
      "Title": "",
      "Subtitle": "Graduate Software Developer: Software Defined Networking\nIBM",
      "Body": "At IBM my role was concerned with developing distributed solutions in the field of software-defined networking (i.e. Telco-Networks). I collaborated with a number of cross-disciplinary development teams. I contributed early and delivered on features quickly, taking ownership of features in the process. I developed on distributed clusters using Kubernetes and the Redhat Openshift Container Platform (OCP). I created and maintained Operators and Helm-Charts to manage installation of resources within clusters. I led scrum meetings for my team and presented my contributions in cross-team Sprint playbacks.\nDocker, Kubernetes, GoLang"
    },
    {
      "Title": "",
      "Subtitle": "Full-Stack Developer: Global Risk Analytics Technology\nBank of America Merrill Lynch",
      "Body": "For 6-months I worked as a Full-stack engineer across different areas of Global Risk Analytics Tech. I got some fantastic hands on experience with Code-Reviews, Systems Design, Distributed Systems, Distributed Computing through HDFS, Apache Spark and Hive. I also learned a huge amount in the area of financial theory and financial technology. I obtained my first-hand experience with industry level SDLC and CICD technologies.\n\n I learned how to work in a software team. How to effectively communicate between business and technology teams and break down complex/abstract ideas into simple terms. I learned how to listen and understand people’s point of view. But also how to help improve ideas and take criticism."
    },
    {
      "Title": "",
      "Subtitle": "Front-End Web-Developer\nKoolaMoola",
      "Body": "I worked part-time for around 5 months on web-development and User Interface. Here I got my first start into professional software design. I also got my first hands-on experience with React U.I. framework, Spring/Springboot (Java) for back-end web-development.\n\n I was faced with a pretty difficult challenge, to quickly learn the Spring framework. This was a huge challenge that I overcame. I had Java experience going into the job but had to learn Spring from scratch. I achieved this through reading the documentation online, YouTube videos and online web-forums."
    },
    {
      "Title": "",
      "Subtitle": "Risk Advisory Intern\nErnst & Young",
      "Body": "Over the summer of 2020 I took part in the EY SIP program. This was my first job in a professional setting. I learned the essentials of communication and got a taste for consultancy and project-management. \n\nThis was during the midst of the pandemic in 2020 and yet they were still equipped to carry out the internship virtually and it wasn't cancelled, as many of us feared. I am massively grateful to have been selected for the program. This program involved a lot of learning and collaboration sessions. I also shadowed my team-mates and learned from them. I improved my communication, listening and team-working skills."
    }
  ]
}
